Repository: andyvand/winsparkle
Catalog: translations/*.po
Languages: uz

source: Software Update
uz: Dasturni yangilash

source: Release notes:
uz: Nima yangi:

source: Skip this version
uz: Bu versiyani oʻtkazib yuborish

source: Remind me later
uz: Keyinroq eslat

source: Install update
uz: Yangilanishni oʻrnatish

source: %s cannot be restarted.
uz: %sʼni qayta ishga tushirish mumkin emas.

source: Make sure that you don't have any unsaved documents and try again.
uz: Saqlanmagan hujjatlaringiz yoʻqligiga ishonch hosil qiling va qayta urinib koʻring.

source: Launching the installer...
uz: Oʻrnatuvchi ishga tushirilmoqda...

source: Failed to launch the installer.
uz: Oʻrnatuvchini ishga tushirib boʻlmadi.

source: Checking for updates...
uz: Yangilanishlar tekshirilmoqda...

source: Cancel
uz: Bekor qilish

source: You're up to date!
uz: Sizniki eng yangisi!

source: %s %s is currently the newest version available.
uz: %s %s hozirda mavjud eng yangi versiya.

source: Close
uz: Yopish

source: Update Error!
uz: Yangilanishda xatolik yuz berdi!

source: An error occurred in retrieving update information; are you connected to the internet? Please try again later.
uz: Yangilanish maʻlumotlarini olishda xatolik yuz berdi; internetga ulanganmisiz? Keyinroq qayta urinib koʻring.

source: The update is improperly signed.
uz: Yangilanish notoʻgʻri imzolangan.

source: A new version of %s is available!
uz: %s`ni yangi versiyasi mavjud!

source: Get update
uz: Yangilanishni olish

source: %s %s is now available (you have %s). Would you like to download it now?
uz: %s %s oʻrnatsa boʻladi (sizda %s). Hozir yuklab olmoqchimisiz?

source: Downloading update...
uz: Yangilash yuklanmoqda...

source: %s of %s
uz: %s / %s

source: Ready to install.
uz: Oʻrnatishga tayyor.

source: Check for updates automatically?
uz: Yangilanishlar avtomatik tekshirilsinmi?

source: Should %s automatically check for updates? You can always check for updates manually from the menu.
uz: %s avtomatik tarzda yangilanishlarni tekshirsinmi? Yangilanishlarni oʻzingiz har doim menyudan tekshirisha olasiz.

source: Check automatically
uz: Avtomatik tekshirilsin

source: Don't check
uz: Tekshirilmasin
